/*
 * Copyright (C) 2020 by Savoir-faire Linux
 * Author: Sébastien Blin <sebastien.blin@savoirfairelinux.com>
 *
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 3 of the License, or
 * (at your option) any later version.
 *
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License
 * along with this program.  If not, see <https://www.gnu.org/licenses/>.
 */

import QtQuick 2.14
import QtQuick.Controls 2.14
import QtQuick.Layouts 1.14
import QtGraphicalEffects 1.14
import QtQuick.Shapes 1.14

import net.jami.Models 1.0
import net.jami.Adapters 1.0
import net.jami.Constants 1.0

import "../../commoncomponents"


Rectangle {
    id: root
    width: 320
    height: 240
    radius: 5
    border.color: JamiTheme.tabbarBorderColor
    color: JamiTheme.backgroundColor


    ColumnLayout {
        id: layout

        anchors.top: contactPickerPopupRect.top
        anchors.topMargin: 15

        // TODO rename
        SearchBar {
            id: searchBar

            Layout.alignment: Qt.AlignCenter
            Layout.topMargin: 5
            Layout.bottomMargin: 5
            Layout.preferredWidth: root.width
            Layout.preferredHeight: 35

            onSearchBarTextChanged: {
            }
        }

        Rectangle {

            Layout.alignment: Qt.AlignCenter
            Layout.topMargin: 5
            Layout.bottomMargin: 5
            Layout.preferredWidth: root.width
            Layout.preferredHeight: root.height
            
            Component {
                id: emojiDelegate
                Item {
                    width: grid.cellWidth; height: grid.cellHeight
                    Column {
                        anchors.fill: parent
                        Text { text: modelData; anchors.horizontalCenter: parent.horizontalCenter }
                    }

                    MouseArea {
                        anchors.fill: parent
                        hoverEnabled: true

                        onEntered: {
                            // TODO
                        }
                        onExited: {
                            // TODO
                        }
                        onClicked: {
                            searchBar.setText(modelData)
                            // TODO close & add to view
                        }
                    }
                }
            }

            GridView {
                id: grid
                anchors.fill: parent
                cellWidth: 32; cellHeight: 32

                model: ["😀","😁","😂","🤣","😃","😄","😅","😆","😉","😊","😋","😎","😍","🥰","😘","😗","😙","😚","☺️","🙂","🤗","🤩","🤔","🤨","😐","😑","😶","🙄","😏","😣","😥","😮","🤐","😯","😪","😫","😴","😌","😛","😜","😝","🤤","😒","😓","😔","😕","🙃","🤑","😲","☹️","🙁","😖","🥵","😞","😟","🥶","🥴","😤","😢","😭","😦","😧","🥳","😨","😩","🤯","😬","😰","😱","😳","🤪","😵","😡","🥺","😠","🤬","😷","🤒","🤕","🤢","🤮","🤧","😇","🤠","🤥","🤫","🤭","🧐","🤓","😈","👿","🤡","👹","👺","💀","☠️","👻","👽","👾","🤖","💩","🙊","💋","💘","💝","💖","💗","💓","💞","💕","💌","❣️","💔","❤️","🧡","💛","💚","💙","💜","🖤","💟","💍","💎","💐","💒","👶","🧒","👦","👧","🧑","👨","👱‍♂️","🧔","👩","👱‍♀️","🧓","👴","👵","👨‍⚕️","👩‍⚕️","👨‍🎓","👩‍🎓","👨‍🏫","👩‍🏫","👨‍⚖️","👩‍⚖️","👨‍🌾","👩‍🌾","👨‍🍳","👩‍🍳","👨‍🔧","👩‍🔧","👨‍🏭","👩‍🏭","👨‍💼","👩‍💼","👨‍🔬","👩‍🔬","👨‍💻","👩‍💻","👨‍🎤","👩‍🎤","👨‍🎨","👩‍🎨","👨‍✈️","👩‍✈️","👨‍🚀","👩‍🚀","👨‍🚒","👩‍🚒","👮‍♂️","👮‍♀️","🕵️‍♂️","🕵️‍♀️","💂‍♂️","💂‍♀️","👷‍♂️","👷‍♀️","🤴","👸","👳‍♂️","👳‍♀️","👲","🧕","🤵","👰","🤰","🤱","👼","🎅","🤶","🧙‍♂️","🧙‍♀️","🧚‍♂️","🧚‍♀️","👨‍🦰","🧛‍♂️","🧛‍♀️","👨‍🦱","👨‍🦳","👨‍🦲","🧜‍♂️","🧜‍♀️","🧝‍♂️","👩‍🦰","👩‍🦱","🧝‍♀️","👩‍🦳","🧞‍♂️","👩‍🦲","🧞‍♀️","🧟‍♂️","🧟‍♀️","🙍‍♂️","🙍‍♀️","🙎‍♂️","🙎‍♀️","🙅‍♂️","🙅‍♀️","🙆‍♂️","🙆‍♀️","💁‍♂️","💁‍♀️","🙋‍♂️","🙋‍♀️","🙇‍♂️","🙇‍♀️","🤦","🤦‍♂️","🤦‍♀️","🤷","🤷‍♂️","🤷‍♀️","💆‍♂️","💆‍♀️","💇‍♂️","💇‍♀️","👤","👥","🦸‍♂️","🦸‍♀️","🦹‍♂️","🦹‍♀️","👫","👬","👭","👩‍❤️‍💋‍👨","👨‍❤️‍💋‍👨","👩‍❤️‍💋‍👩","👩‍❤️‍👨","👨‍❤️‍👨","👩‍❤️‍👩","👨‍👩‍👦","👨‍👩‍👧","👨‍👩‍👧‍👦","👨‍👩‍👦‍👦","👨‍👩‍👧‍👧","👨‍👨‍👦","👨‍👨‍👧","👨‍👨‍👧‍👦","👨‍👨‍👦‍👦","👨‍👨‍👧‍👧","👩‍👩‍👦","👩‍👩‍👧","👩‍👩‍👧‍👦","👩‍👩‍👦‍👦","👩‍👩‍👧‍👧","👨‍👦","👨‍👦‍👦","👨‍👧","👨‍👧‍👦","👨‍👧‍👧","👩‍👦","👩‍👦‍👦","👩‍👧","👩‍👧‍👦","👩‍👧‍👧","🦵","🦶","🤳","💪","👈","👉","☝️","👆","🖕","👇","✌️","🤞","🖖","🤘","🤙","🖐️","✋","👌","👍","👎","✊","👊","🤛","🤜","🤚","👋","🤟","✍️","👏","👐","🙌","🤲","🙏","🤝","👂","👃","👀","👁️","🧠","👅","👄","🚶‍♂️","🚶‍♀️","🏃‍♂️","🏃‍♀️","💃","🕺","👯‍♂️","👯‍♀️","🧖‍♂️","🧖‍♀️","🧗‍♂️","🧗‍♀️","🧘‍♂️","🧘‍♀️","🛌","🕴️","🗣️","🤺","🏇","⛷️","🏂","🏌️‍♂️","🏌️‍♀️","🏄‍♂️","🏄‍♀️","🚣‍♂️","🚣‍♀️","🏊‍♂️","🏊‍♀️","⛹️‍♂️","⛹️‍♀️","🏋️‍♂️","🏋️‍♀️","🚴‍♂️","🚴‍♀️","🚵‍♂️","🚵‍♀️","🏎️","🏍️","🤸","🤸‍♂️","🤸‍♀️","🤼","🤼‍♂️","🤼‍♀️","🤽","🤽‍♂️","🤽‍♀️","🤾","🤾‍♂️","🤾‍♀️","🤹","🤹‍♂️","🤹‍♀️","🎖️","🏆","🏅","🥇","🥈","🥉","⚽","⚾","🏀","🏐","🏈","🏉","🎾","🎳","🏏","🏑","🥎","🏒","🏓","🏸","🥊","🥋","🥏","🥅","⛸️","🎣","🥍","🎿","🛷","🥌","🎯","🎱","🧿","🧩","🧸","🧵","🧶","📢","📣","📯","🔔","🎼","🎵","🎶","🎙️","🎚️","🎛️","🎧","📻","🎷","🎸","🎹","🎺","🎻","🥁","💽","💿","📀","🎥","🎞️","📽️","🎬","📺","📷","📸","📹","📼","🥭","🍇","🍈","🍉","🍊","🍋","🍌","🍍","🍎","🍏","🍐","🍑","🍒","🥬","🍓","🥝","🍅","🥥","🥑","🍆","🥔","🥕","🌽","🌶️","🥯","🥒","🥦","🥜","🌰","🍞","🥐","🥖","🥨","🥞","🧀","🍖","🍗","🥩","🥓","🍔","🍟","🍕","🌭","🥪","🌮","🌯","🥙","🥚","🧂","🍳","🥘","🍲","🥣","🥗","🍿","🥫","🍱","🍘","🍙","🍚","🍛","🍜","🥮","🍝","🍠","🍢","🍣","🍤","🍥","🍡","🥟","🥠","🥡","🍦","🍧","🍨","🍩","🍪","🧁","🎂","🍰","🥧","🍫","🍬","🍭","🍮","🍯","🍼","🥛","☕","🍵","🍶","🍾","🍷","🍸","🍹","🍺","🍻","🥂","🥃","🥤","🥢","🍽️","🍴","🥄","🏺","😺","😸","😹","😻","😼","😽","🙀","😿","😾","🙈","🙉","🦝","🐵","🐒","🦍","🐶","🐕","🐩","🐺","🦊","🐱","🐈","🦁","🐯","🐅","🐆","🐴","🐎","🦄","🦓","🦌","🐮","🦙","🐂","🐃","🐄","🐷","🦛","🐖","🐗","🐽","🐏","🐑","🐐","🐪","🐫","🦒","🐘","🦏","🐭","🐁","🐀","🦘","🐹","🦡","🐰","🐇","🐿️","🦔","🦇","🐻","🐨","🐼","🐾","🦃","🐔","🦢","🐓","🐣","🐤","🦚","🐥","🐦","🦜","🐧","🕊️","🦅","🦆","🦉","🐸","🐊","🐢","🦎","🐍","🐲","🐉","🦕","🦖","🐳","🐋","🐬","🐟","🐠","🐡","🦈","🐙","🐚","🦀","🦟","🦐","🦑","🦠","🐌","🦋","🐛","🐜","🐝","🐞","🦗","🕷️","🕸️","🦂","🦞","🌸","💮","🏵️","🌹","🥀","🌺","🌻","🌼","🌷","🌱","🌲","🌳","🌴","🌵","🌾","🌿","☘️","🍀","🍁","🍂","🍃","🍄","⌛","⏳","⚡","🎆","🎇","🔇","🔈","🔉","🔊","🔕","🔒","🔓","🔏","🔐","🚮","🚰","♿","🚹","🚺","🚻","🚼","🚾","🛂","🛃","🛄","🛅","⚠️","🚸","⛔","🚫","🚳","🚭","🚯","🚱","🚷","📵","🔞","⏭️","⏯️","⏮️","⏸️","⏹️","⏺️","⏏️","🎦","🔅","🔆","📶","📳","📴","🔱","ℹ️","Ⓜ️","🅿️","🧭","⬆️","↗️","➡️","↘️","⬇️","↙️","⬅️","↖️","↕️","↔️","↩️","↪️","⤴️","⤵️","🔃","🔄","🔀","🔁","🔂","▶️","⏩","◀️","⏪","🔼","⏫","🔽","⏬"]
                delegate: emojiDelegate
                focus: true
            }
        }

    }
}
